import "../iso_locale_mapper.dart";

/// Contains 45 translation(s).
/// Provides translations for the Uzbek language
/// and Cyrillic script locale.
class UzCyrlCurrenciesL10N extends IsoLocaleMapper<String> {
  /// Provides currency translations for the `uz_Cyrl` locale.
  UzCyrlCurrenciesL10N() {
    map.addAll({
      "ANG": "Голланд Антил гульдени",
      "ARS": "Аргентина песоси",
      "AWG": "Аруба флорини",
      "BBD": "Барбадос доллари",
      "BMD": "Бермуда доллари",
      "BOB": "Боливия болвиани",
      "BRL": "Бразил реали",
      "BSD": "Багама доллари",
      "BZD": "Белиз доллари",
      "CAD": "Канада доллари",
      "CLP": "Чили песоси",
      "CNY": "Хитой юани",
      "COP": "Колумбия песоси",
      "CRC": "Коста-Рика колони",
      "CUC": "Куба Айирбошлаш песоси",
      "CUP": "Куба песоси",
      "DOP": "Доминикан песоси",
      "DZD": "Жазоир динори",
      "EGP": "Миср фунти",
      "EUR": "Евро",
      "FKP": "Фолькленд ороли фунти",
      "GBP": "Инглиз фунт",
      "GTQ": "Гватемала кветзали",
      "GYD": "Гаяна доллари",
      "HNL": "Гондурас лемпираси",
      "HTG": "Гаити гурдаси",
      "INR": "Ҳинд рупияси",
      "JMD": "Ямайка доллари",
      "JPY": "Япон йенаси",
      "KYD": "Кайман ороли Доллари",
      "LYD": "Ливия динори",
      "MAD": "Марокаш дирҳами",
      "MXN": "Мексика песоси",
      "NIO": "Никарагуа кордобаси",
      "PAB": "Панама бальбоаси",
      "PEN": "Перу сол",
      "PYG": "Парагвай гуарани",
      "RUB": "Рус рубли",
      "SRD": "Суринам доллари",
      "TTD": "Тринидад ва Тобаго доллари",
      "USD": "АҚШ доллари",
      "UYU": "Уругвай песоси",
      "UZS": "Ўзбекистон сўм",
      "VES": "Венесуэла боливари",
      "XCD": "Шарқий Кариб доллари",
    });
  }
}
