import "../iso_locale_mapper.dart";

/// Contains 35 translation(s).
/// Provides translations for the Kazakh language
/// and Cyrillic script locale.
class KkCyrlCountriesL10N extends IsoLocaleMapper<String> {
  /// Provides country translations for the `kk_Cyrl` locale.
  KkCyrlCountriesL10N() {
    map.addAll({
      "ARE": "Біріккен Араб Эмираттары",
      "ASM": "Американ Самоасы",
      "ATA": "Антарктика",
      "ATF": "Францияның солтүстік аймағы",
      "ATG": "Антигуа мен Барбуда",
      "AZE": "Әзербайжан",
      "BES": "Кариб Нидерландысы",
      "CCK": "Кокос аралдары",
      "COM": "Комор",
      "CXR": "Кристмас аралы",
      "CZE": "Чех Республикасы",
      "GBR": "Бірікккен Корольдік",
      "GRC": "Греция",
      "HKG": "Қытай Халық Республикасының Гонг-Конг арнайы әкімшілік ауданы",
      "KOR": "Солтүстік Корея",
      "LBY": "Либия",
      "MAC": "Қытай Халық Республикасының Макао арнайы әкімшілік ауданы",
      "MAR": "Морокко",
      "MDV": "Мальдив Республикасы",
      "MKD": "Македония",
      "MNP": "Солтүстік Мариан аралдары",
      "NLD": "Голландия",
      "PHL": "Филиппиндер",
      "PRK": "Оңтүстік Корея",
      "SGS": "Оңтүстік Георгия және Оңтүстік Сандвичев аралы",
      "SJM": "Шпицберген мен Ян-Майен",
      "STP": "Сан-Томе мен Принсипи",
      "TCA": "Туркс пен Кайкос",
      "TTO": "Тринидад пен Тобаго",
      "UMI": "АҚШ-тың ішкі кіші аралдары",
      "UNK": "Косово",
      "USA": "АҚШ",
      "VCT": "Сент-Винсент және Гренадиндер",
      "WLF": "Уоллис пен Футуна",
      "ZAF": "Оңтүстік Африка республикасы",
    });
  }
}
